---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateNosing
source: html/b48d23af-0695-b079-54e5-92e12a56c146.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateNosing Property

Can't create nosing on one or more treads.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateNosing { get; }
```